AliBaWazir/SelfBalancingRobot/Software/Balancing Software/stm32fxxx_hal_libraries-master/stm32fxxx_hal_libraries-master/01-STM32Fxxx_Keil_CMSIS_Default_Project/User/main.c
/**
 * Keil project template
 *
 * Before you start, select your target, on the right of the "Load" button
 *
 * @author    Tilen Majerle
 * @email     tilen@majerle.eu
 * @website   http://stm32f4-discovery.com
 * @ide       Keil uVision 5
 * @conf      PLL parameters are set in "Options for Target" -> "C/C++" -> "Defines"
 * @packs     STM32F4xx/STM32F7xx Keil packs are requred with HAL driver support
 * @stdperiph STM32F4xx/STM32F7xx HAL drivers required
 */
/* Include core modules */
#include "stm32fxxx_hal.h"
/* Include my libraries here */
#include "defines.h"

#include "tm_stm32_delay.h"
	
int main(void) {
	/* Init system clock for maximum system speed */
	TM_RCC_InitSystem();
	
	/* Init HAL layer */
	HAL_Init();
	
	/* Init leds */
	//TM_DISCO_LedInit();
    TM_GPIO_Init(GPIOC, GPIO_Pin_12, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
    TM_GPIO_Init(GPIOC, GPIO_Pin_13, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
    TM_GPIO_Init(GPIOC, GPIO_Pin_14, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
    TM_GPIO_Init(GPIOC, GPIO_Pin_15, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
	
	/* Init button */
	//TM_DISCO_ButtonInit();

	/* Init delay */
	TM_DELAY_Init();
	
	while (1) {
		/* Toggle leds */
		//TM_DISCO_LedToggle(LED_ALL);
        TM_GPIO_TogglePinValue(GPIOC, GPIO_Pin_12);
		
		/* Delay 500ms */
		Delayms(200);
        TM_GPIO_TogglePinValue(GPIOC, GPIO_Pin_13);
        Delayms(200);
        TM_GPIO_TogglePinValue(GPIOC, GPIO_Pin_14);
        Delayms(200);
        TM_GPIO_TogglePinValue(GPIOC, GPIO_Pin_15);
	}
}

